# 4.2 Aufgaben

Diese Aufgabe ist länger als Lernzielkontrolle und fasst alle Themen aus 4.2 and früher zusammen.

Lösen Sie diese Aufgabe in VS Code oder in Jupyter Notebook.

**Erzeugen einen Datensatz mit folgenden Spalten:**
1. [Vorname](https://catalog.data.gov/dataset/popular-baby-names/resource/02e8f55e-2157-4cb2-961a-2aabb75cbc8b)
3. [Nachname](https://gist.github.com/craigh411/19a4479b289ae6c3f6edb95152214efc)
3. [Job](https://github.com/johnlsheridan/occupations/blob/master/occupations.csv)
4. [Firma](https://github.com/prasertcbs/basic-dataset/blob/master/companies.csv)
5. Alter - zufällig (18 - 65)
6. Gehalt - zufällig plus auf Alter basiert
7. Email - auf Name und Firma basiert
8. Geburtsjahr - auf Alter und heutiges Jahr basiert


Sie müssen die Daten für Spalten 1-4 herunterladen. Spalten 5-8 wird entweder erzeugt oder von anderen Daten herausgekommen.

> Bitte benutzen Sie NumPy und pandas.

In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
df = pd.DataFrame(columns=['vorname', 'nachname', 'job', 'firma', 'alter', 'gehalt', 'email', 'geburtsjahr', 'geburtstag'])

In [3]:
df.empty

True

In [4]:
os.getcwd()

'c:\\Users\\pat_h\\OneDrive\\p-spohr-repos\\HTW-Berlin-Pytorium\\Lösungen'

In [5]:
df_dict = {}
for dirpath, dirnames, filenames in os.walk('C:\\Users\\pat_h\\OneDrive\\p-spohr-repos\\HTW-Berlin-Pytorium\\4-Wichtige-Libraries\\Aufgaben\\daten'):
    for file in filenames:
        # print(os.path.splitext(file)[0])
        df_dict[os.path.splitext(file)[0]] = pd.read_csv(os.path.join(dirpath,file))

In [6]:
df_dict.keys()

dict_keys(['firma', 'job', 'nachname', 'vorname'])

In [7]:
df_dict['vorname']['Child\'s First Name'] = df_dict['vorname']['Child\'s First Name'].str.capitalize()

In [8]:
df_dict['nachname']

       lastname  Unnamed: 1
0         Smith         NaN
1       Johnson         NaN
2      Williams         NaN
3         Brown         NaN
4         Jones         NaN
...         ...         ...
998        Duke         NaN
999        Odom         NaN
1000  Daugherty         NaN
1001     Travis         NaN
1002       Tang         NaN

[1003 rows x 2 columns]

In [9]:
df.columns

Index(['vorname', 'nachname', 'job', 'firma', 'alter', 'gehalt', 'email',
       'geburtsjahr', 'geburtstag'],
      dtype='object')

In [10]:
df_dict['nachname']['lastname'].sample(10, axis=0).values

array(['Truong', 'Sellers', 'Durham', 'Decker', 'Wu', 'Payne',
       'Mcconnell', 'Hanson', 'Tucker', 'Nash'], dtype=object)

In [11]:
n_size = 10
# df['vorname'] = df_dict['vorname']['Child\'s First Name'][0:n_size].str.capitalize()
# df['nachname'] = df_dict['nachname']['lastname'][0:n_size]
# df['job'] = df_dict['job']['Occupations'][0:n_size]
# df['firma'] = df_dict['firma']['name_latest'][0:n_size]

# df['vorname'] = df_dict['vorname']['Child\'s First Name'].sample(n_size, axis=0).str.capitalize().values
# df['nachname'] = df_dict['nachname']['lastname'].sample(n_size, axis=0).values
# df['job'] = df_dict['job']['Occupations'].sample(n_size, axis=0).values
# df['firma'] = df_dict['firma']['name_latest'].sample(n_size, axis=0).values

In [13]:
# automatisiere das Verfahren mit Schleifen
spalten_index = {'vorname':3, 'nachname': 0, 'job':0, 'firma': 1}
for sp_name, index in spalten_index.items():
    df[sp_name] = df_dict[sp_name].iloc[ : , index].sample(n_size, axis=0).values

In [14]:
df

,vorname,nachname,job,firma,alter,gehalt,email,geburtsjahr,geburtstag
0,Lauren,Obrien,Ambulance Controller,"Cole Credit Property Trust IV, Inc.",NaN,NaN,NaN,NaN,NaN
1,Thomas,Cohen,Caretaker,"Luvu Brands, Inc.",NaN,NaN,NaN,NaN,NaN
2,Shaniya,Stanley,Envoy,Ohio Valley Banc Corp,NaN,NaN,NaN,NaN,NaN
3,Jeremy,Sanford,Mineralologist,"Solar Wind Energy Tower, Inc.",NaN,NaN,NaN,NaN,NaN
4,Leona,Hensley,Rig Worker,Taglikeme Corp.,NaN,NaN,NaN,NaN,NaN
5,Londyn,Malone,Storewoman,"Immobiliare Global Investments, Inc.",NaN,NaN,NaN,NaN,NaN
6,June,S,Television Producer,Innerworkings Inc,NaN,NaN,NaN,NaN,NaN
7,Mahnoor,Gallegos,Psychologist,Green Hygienics Holdings Inc.,NaN,NaN,NaN,NaN,NaN
8,Greyson,Pennington,Metal Polisher,"Premier Exhibitions, Inc.",NaN,NaN,NaN,NaN,NaN
9,Joseph,Reyes,Supply Teacher,Csra Inc.,NaN,NaN,NaN,NaN,NaN

In [71]:
# df.vorname.str + df.nachname.str
# TypeError: unsupported operand type(s) for +: 'StringMethods' and 'StringMethods'

In [72]:
df.vorname.str.join(' ')

0    G a b r i e l
1    A l b e r t o
2        S i e n a
3      G i a n n a
4          H u g o
5      S k y l a h
6        E l e n a
7      O l i v e r
8      E l i a n a
9    S h a n i y a
Name: vorname, dtype: object

In [73]:
df.vorname.str.join(' ').str.split()

0    [G, a, b, r, i, e, l]
1    [A, l, b, e, r, t, o]
2          [S, i, e, n, a]
3       [G, i, a, n, n, a]
4             [H, u, g, o]
5       [S, k, y, l, a, h]
6          [E, l, e, n, a]
7       [O, l, i, v, e, r]
8       [E, l, i, a, n, a]
9    [S, h, a, n, i, y, a]
Name: vorname, dtype: object

In [20]:
df.vorname.str.cat(df.nachname, sep=' ')

0         Lauren Obrien
1          Thomas Cohen
2       Shaniya Stanley
3        Jeremy Sanford
4         Leona Hensley
5         Londyn Malone
6                June S
7      Mahnoor Gallegos
8    Greyson Pennington
9          Joseph Reyes
Name: vorname, dtype: object

In [15]:
rng = np.random.default_rng()

In [16]:
df['alter'] = rng.integers(18, 65, df.shape[0])

In [19]:
df['gehalt'] = ((df.alter / 100) * rng.normal(8000, 2000, len(df))).round(2)

In [21]:
def email_par(ser : pd.Series):

    return f'{ser.vorname}.{ser.nachname}@{ser.firma.split()[0]}.com'

In [22]:
f'{df.vorname}.{df.nachname}@{df.firma}'

In [23]:
df.email

0    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
1    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
2    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
3    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
4    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
5    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
6    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
7    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
8    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
9    0     Lauren\n1     Thomas\n2    Shaniya\n3   ...
Name: email, dtype: object

In [24]:
df['email'] = df.apply(email_par, axis=1)

In [25]:
df.email

0            Lauren.Obrien@Cole.com
1             Thomas.Cohen@Luvu.com
2          Shaniya.Stanley@Ohio.com
3          Jeremy.Sanford@Solar.com
4       Leona.Hensley@Taglikeme.com
5     Londyn.Malone@Immobiliare.com
6          June.S@Innerworkings.com
7        Mahnoor.Gallegos@Green.com
8    Greyson.Pennington@Premier.com
9             Joseph.Reyes@Csra.com
Name: email, dtype: object

In [26]:
df['geburtsjahr'] = pd.Timestamp.today().year - df.alter

In [82]:
b_days = rng.integers(1, 31, n_size)
b_months = rng.integers(1, 12, n_size)
geburtstagen = pd.Series([pd.Timestamp(day=bd, month=bm, year=by) for bd, bm, by in zip(b_days, b_months, df.geburtsjahr.values)])

In [83]:
df['geburtstag'] = geburtstagen

In [27]:
df

,vorname,nachname,job,firma,alter,gehalt,email,geburtsjahr,geburtstag
0,Lauren,Obrien,Ambulance Controller,"Cole Credit Property Trust IV, Inc.",37,2788.16,Lauren.Obrien@Cole.com,1987,NaN
1,Thomas,Cohen,Caretaker,"Luvu Brands, Inc.",26,1493.40,Thomas.Cohen@Luvu.com,1998,NaN
2,Shaniya,Stanley,Envoy,Ohio Valley Banc Corp,60,4207.81,Shaniya.Stanley@Ohio.com,1964,NaN
3,Jeremy,Sanford,Mineralologist,"Solar Wind Energy Tower, Inc.",20,1496.31,Jeremy.Sanford@Solar.com,2004,NaN
4,Leona,Hensley,Rig Worker,Taglikeme Corp.,62,4123.13,Leona.Hensley@Taglikeme.com,1962,NaN
5,Londyn,Malone,Storewoman,"Immobiliare Global Investments, Inc.",59,3591.23,Londyn.Malone@Immobiliare.com,1965,NaN
6,June,S,Television Producer,Innerworkings Inc,24,1047.88,June.S@Innerworkings.com,2000,NaN
7,Mahnoor,Gallegos,Psychologist,Green Hygienics Holdings Inc.,44,3262.18,Mahnoor.Gallegos@Green.com,1980,NaN
8,Greyson,Pennington,Metal Polisher,"Premier Exhibitions, Inc.",29,2287.65,Greyson.Pennington@Premier.com,1995,NaN
9,Joseph,Reyes,Supply Teacher,Csra Inc.,55,5913.33,Joseph.Reyes@Csra.com,1969,NaN

In [85]:
# 2. Methode um beliebige Daten zu erzeugen
geburtstagen_2 = pd.date_range(start= pd.Timestamp(day=1, month=1, year=1959), 
              end= pd.Timestamp(day=1, month=1, year=2006), 
              freq='YE-JAN').to_series().sample(10,replace=True)
geburtstagen_2 = pd.DataFrame(geburtstagen, columns=['geburtstag'])
geburtstagen_2

  geburtstag
0 1965-08-17
1 1982-11-17
2 1987-09-23
3 1961-01-30
4 1987-11-14
5 1993-02-18
6 1987-10-20
7 1991-05-04
8 1981-05-02
9 1967-05-11

In [86]:
df = (
df.pipe(pd.DataFrame.drop, **{'axis': 0, 'columns':['geburtsjahr', 'geburtstag']})
.pipe(pd.DataFrame.merge, **{'right': geburtstagen_2, 'left_index': True, 'right_index': True})
)

In [87]:
df

,vorname,nachname,job,firma,alter,gehalt,email,geburtstag
0,Gabriel,Richards,Shunter,Quicklogic Corporation,59,2162.07,Gabriel.Richards@Quicklogic.com,1965-08-17
1,Alberto,Pham,Quantity Surveyor,Fortegra Financial Corp,42,3595.95,Alberto.Pham@Fortegra.com,1982-11-17
2,Siena,Crawford,Careers Officer,Marvell Technology Group LTD,37,2845.01,Siena.Crawford@Marvell.com,1987-09-23
3,Gianna,Oconnell,Operator,Lantronix Inc,63,7239.75,Gianna.Oconnell@Lantronix.com,1961-01-30
4,Hugo,Kelly,Sculptor,Furmanite Corp,37,2599.25,Hugo.Kelly@Furmanite.com,1987-11-14
5,Skylah,Bryan,Scaffolder,Felcor Lodging Trust Inc,31,1202.07,Skylah.Bryan@Felcor.com,1993-02-18
6,Elena,Vega,Assistant Teacher,Outerwall Inc,37,2988.06,Elena.Vega@Outerwall.com,1987-10-20
7,Oliver,Burns,Refuse Collector,Insteel Industries Inc,33,2277.85,Oliver.Burns@Insteel.com,1991-05-04
8,Eliana,Mahoney,Piano Tuner,Star Gold Corp.,43,3950.52,Eliana.Mahoney@Star.com,1981-05-02
9,Shaniya,Avery,Laundry Worker,"Moxian, Inc.",57,6867.34,"Shaniya.Avery@Moxian,.com",1967-05-11

In [88]:
df.alter = [pd.Timestamp.today().year - gb.year for gb in df.geburtstag]
df.alter

0    59
1    42
2    37
3    63
4    37
5    31
6    37
7    33
8    43
9    57
Name: alter, dtype: int64

In [89]:
df

,vorname,nachname,job,firma,alter,gehalt,email,geburtstag
0,Gabriel,Richards,Shunter,Quicklogic Corporation,59,2162.07,Gabriel.Richards@Quicklogic.com,1965-08-17
1,Alberto,Pham,Quantity Surveyor,Fortegra Financial Corp,42,3595.95,Alberto.Pham@Fortegra.com,1982-11-17
2,Siena,Crawford,Careers Officer,Marvell Technology Group LTD,37,2845.01,Siena.Crawford@Marvell.com,1987-09-23
3,Gianna,Oconnell,Operator,Lantronix Inc,63,7239.75,Gianna.Oconnell@Lantronix.com,1961-01-30
4,Hugo,Kelly,Sculptor,Furmanite Corp,37,2599.25,Hugo.Kelly@Furmanite.com,1987-11-14
5,Skylah,Bryan,Scaffolder,Felcor Lodging Trust Inc,31,1202.07,Skylah.Bryan@Felcor.com,1993-02-18
6,Elena,Vega,Assistant Teacher,Outerwall Inc,37,2988.06,Elena.Vega@Outerwall.com,1987-10-20
7,Oliver,Burns,Refuse Collector,Insteel Industries Inc,33,2277.85,Oliver.Burns@Insteel.com,1991-05-04
8,Eliana,Mahoney,Piano Tuner,Star Gold Corp.,43,3950.52,Eliana.Mahoney@Star.com,1981-05-02
9,Shaniya,Avery,Laundry Worker,"Moxian, Inc.",57,6867.34,"Shaniya.Avery@Moxian,.com",1967-05-11